[
  {
    "chunk_summary": [
      {
        "pages": [
          1
        ],
        "summary": "Introduction to the Binomial Representation Theorem. The lecturer follows Baxter & Rennie §2.3. A set of branch probabilities q_j in (0,1) was previously found. This permits pricing derivatives by taking discounted expectations; the discrete expectation result will carry to continuous limits."
      },
      {
        "pages": [
          2
        ],
        "summary": "Definition of a discrete binomial process S on a recombining tree: the process is the set of possible stock values at each node. One example tree is shown (figure 2.8 node-numbered and figure 2.9 with price values). The random variable S_i denotes the stock value at time i."
      },
      {
        "pages": [
          3
        ],
        "summary": "Definition of a probability measure on the tree: denote branch probabilities by (p_j) or (q_j) and the associated measure by P (real-world/simple) or Q (risk-neutral/complex). The measure assigns likelihoods to up/down jumps at each node. Figure 2.10a illustrates a simple (P) measure with equal 1/2 branch probabilities; figure 2.10b illustrates a non-uniform measure Q with different branch probabilities."
      }
    ],
    "key_definitions": [
      {
        "term": "Process S",
        "definition": "A set of possible stock values assigned to each node of the binomial tree; the entire collection of node-values across times forms the process S."
      },
      {
        "term": "S_i",
        "definition": "Random variable denoting the value of the stock process at discrete time i (the node value at time i along a path)."
      },
      {
        "term": "Probability measure (P or Q)",
        "definition": "An assignment of branch probabilities (p_j or q_j) on the binomial tree. P denotes a simple or 'real-world' measure (examples use equal branch probabilities), while Q denotes another measure (commonly the martingale / risk-neutral measure) which may have non-uniform branch probabilities."
      },
      {
        "term": "q_j ∈ (0,1)",
        "definition": "Notation meaning each branch probability q_j lies strictly between 0 and 1 (non-degenerate probabilities)."
      }
    ],
    "theorems": [],
    "equations": [
      {
        "latex": "q_j \\in (0,1)",
        "meaning": "Each branch probability used on the binomial tree is between 0 and 1 (exclusive).",
        "intuition": "Branch probabilities must be valid probabilities (non-zero, non-one) so that both up and down outcomes are possible."
      },
      {
        "latex": "S_i",
        "meaning": "Random variable denoting the stock price at discrete time i.",
        "intuition": "Treat the stock price at each discrete tick as a random variable determined by the realized path on the tree."
      },
      {
        "latex": "\\text{Measure }\\mathbb{P}\\text{ or }\\mathbb{Q}",
        "meaning": "Notation indicating which probability measure is being used to evaluate probabilities/expectations on the tree (P = simple/real-world, Q = an alternative measure).",
        "intuition": "Different measures encode different 'weights' for branches; choosing Q appropriately can make discounted asset processes martingales and is central to pricing."
      }
    ],
    "figures": [
      {
        "id": "Figure 2.8",
        "type": "tree diagram (node numbers)",
        "description": "Binomial tree showing node indices (1..7) at times 0,1,2; topology/branching structure of the discrete model (no prices shown).",
        "axes": "Horizontal axis: time (time: 0, 1, 2). Vertical placement: distinct nodes at each time (node identifiers).",
        "trend": "Structural: two branches from each nonterminal node (up/down). No numeric trend because node labels are indices rather than prices.",
        "significance": "Illustrates the combinatorial/node structure of the binomial process; used to refer to nodes when defining filtrations and claims."
      },
      {
        "id": "Figure 2.9",
        "type": "price tree",
        "description": "Binomial tree with explicit stock prices at each node. Example values shown: S_0 = 80; at time 1: S_1 (up)=120, S_1 (down)=60; at time 2: node prices include 180, 80, 72, 36 (corresponding to the four terminal nodes).",
        "axes": "Horizontal axis: time (0,1,2). Node labels: stock price values at each node.",
        "trend": "Shows possible up/down evolutions of stock price (an initial 80 may move up to 120 or down to 60, then further up/down to the terminal prices listed).",
        "significance": "Concrete example of the process S — used to illustrate claims, conditional expectations and later martingale calculations."
      },
      {
        "id": "Figure 2.10a",
        "type": "probability tree (measure P)",
        "description": "Binomial tree annotated with equal branch probabilities 1/2 at each branch (simple or 'real-world' measure P).",
        "axes": "Horizontal axis: time (0,1,2). Branch labels: probabilities (1/2).",
        "trend": "Uniform branching probabilities: each up and down move from any node is equally likely under P.",
        "significance": "Illustrates the simplest possible measure on the binomial tree; used in examples of conditional expectation under P."
      },
      {
        "id": "Figure 2.10b",
        "type": "probability tree (measure Q)",
        "description": "Binomial tree with non-uniform branch probabilities illustrating a more complex measure Q (labels shown in the slides: e.g., 1/3 and 2/3 at the first split and 2/5 & 3/5 etc. on subsequent splits).",
        "axes": "Horizontal axis: time (0,1,2). Branch labels: probabilities (non-uniform fractions).",
        "trend": "Different branches have different conditional probabilities depending on node — the measure Q is not symmetric across branches.",
        "significance": "Demonstrates that alternative measures (e.g., a candidate martingale / risk-neutral measure) can assign different weights to up/down moves; these weights are central to pricing via expectations under Q."
      }
    ],
    "tables": []
  },
  {
    "chunk_summary": "Pages 4–6 define and illustrate the filtration on a binomial tree, formalize what a claim is, and introduce the conditional expectation operator relative to a measure and a filtration. Key points: a filtration F_i is the history up to time i and uniquely fixes nodes; a claim X is any random variable defined on the nodes at maturity T (equivalently a function of F_T); the conditional expectation operator E_Q[· | F_i] combines a probability measure Q (or P) with history F_i to give the expected value of a future claim given the current history. Numerical examples using the simple measure P show explicit conditional expectations on the tree (Table 2.5) and examples of claims at time 2 (Table 2.4).",
    "key_definitions": {
      "filtration": {
        "symbol": "F_i",
        "definition": "The history of the stock (sequence of nodes) up to and including time i on the tree; it starts at F_0 = {1} and each F_i corresponds to the unique set of nodes reachable consistent with the realized path.",
        "notes": "A filtration fixes a node because there is only one path arriving at each node."
      },
      "claim": {
        "symbol": "X",
        "definition": "A random variable defined on the nodes at a claim time-horizon T (equivalently a function of the filtration F_T). Examples: S_2 (stock at time 2), a call payoff (S_T - K)^+, the maximum price attained up to T.",
        "notes": "A claim is defined only on nodes at time T; a process is defined at all times up to and including T."
      },
      "conditional_expectation_operator": {
        "symbol": "E_Q[· | F_i]",
        "definition": "The operator giving the expectation of a future random variable/claim conditional on the history F_i, computed using measure Q (which supplies the path probabilities).",
        "notes": "E_Q(X | F_i) is the expected value of X along the portion of paths continuing from the initial segment F_i; varying i yields a process (conditional expectation process)."
      }
    },
    "theorems": [],
    "equations": [
      {
        "latex": "F_0 = \\{1\\}",
        "meaning": "Initial filtration at time 0 equals the singleton root node (node 1).",
        "intuition": "At time zero there has been no evolution, so the history contains only the starting node."
      },
      {
        "latex": "F_1 = \\{1,2\\} \\quad \\text{or} \\quad F_1 = \\{1,3\\}",
        "meaning": "Examples of filtrations at time 1 depending on whether the first jump was down (path to node 2) or up (path to node 3).",
        "intuition": "After the first time-step, the observed history distinguishes which branch occurred, so F_1 is the two-node path identifying that branch."
      },
      {
        "latex": "X \\;\\text{is a function of } F_T \\quad(\\text{equivalently } X = X(\\omega)\\text{ determined by node at }T)",
        "meaning": "A claim X (payoff at maturity T) depends only on the node reached at time T — i.e., only on F_T.",
        "intuition": "Payoffs are specified per terminal node; given the realized terminal history, the claim value is fixed."
      },
      {
        "latex": "\\mathbb{E}_{Q}[X\\mid F_i]",
        "meaning": "Conditional expectation of X given history F_i, computed using probability measure Q (path probabilities after time i are weighted by Q).",
        "intuition": "Given what has happened up to time i, take the Q-weighted average of X over the possible continuations from that history."
      },
      {
        "latex": "\\mathbb{E}_{P}(S_2\\mid F_0)=\\frac{180+80+72+36}{4}=92",
        "meaning": "Under the simple measure P (equal probabilities on branches), the unconditional expectation at time 0 of S_2 equals 92.",
        "intuition": "At time 0 there are four terminal nodes, each equally likely under P, so average their S_2 values."
      },
      {
        "latex": "\\mathbb{E}_{P}(S_2\\mid F_1=\\{1,3\\})=\\tfrac{1}{2}(180+80)=130 \\quad ; \\quad \\mathbb{E}_{P}(S_2\\mid F_1=\\{1,2\\})=\\tfrac{1}{2}(72+36)=54",
        "meaning": "Conditional expectations at time 1 under measure P: if the history indicates the 'up' branch (nodes leading to 180 and 80), expectation is 130; if the 'down' branch (72 and 36), expectation is 54.",
        "intuition": "Given which branch occurred at time 1, average the two possible terminal values reachable from that branch with equal weights under P."
      },
      {
        "latex": "\\mathbb{E}_{P}(S_2\\mid F_2)=S_2",
        "meaning": "Conditioning on the full terminal filtration F_2 (i.e., knowing the terminal node) yields the claim itself: the conditional expectation equals the realized S_2.",
        "intuition": "If the history includes the final node, there is no randomness left about S_2; its expected value given that history is the known value."
      }
    ],
    "figures": [],
    "tables": [
      {
        "id": "Table 2.3",
        "description": "The filtration process: mapping node numbers to the associated history (filtration) sets.",
        "key_rows": [
          {
            "node": 1,
            "filtration": "{1}"
          },
          {
            "node": 2,
            "filtration": "{1,2}"
          },
          {
            "node": 3,
            "filtration": "{1,3}"
          },
          {
            "node": 4,
            "filtration": "{1,2,4}"
          },
          {
            "node": 5,
            "filtration": "{1,2,5}"
          },
          {
            "node": 6,
            "filtration": "{1,3,6}"
          },
          {
            "node": 7,
            "filtration": "{1,3,7}"
          }
        ],
        "key_columns": [
          "node",
          "filtration"
        ]
      },
      {
        "id": "Table 2.4",
        "description": "Some claims at time 2: examples of terminal stock values and claim payoffs at each terminal node.",
        "key_rows": [
          {
            "time_2_node": 7,
            "S2": 180,
            "(S2-70)^+": 110,
            "max{S0,S1,S2}": 180
          },
          {
            "time_2_node": 6,
            "S2": 80,
            "(S2-70)^+": 10,
            "max{S0,S1,S2}": 120
          },
          {
            "time_2_node": 5,
            "S2": 72,
            "(S2-70)^+": 2,
            "max{S0,S1,S2}": 80
          },
          {
            "time_2_node": 4,
            "S2": 36,
            "(S2-70)^+": 0,
            "max{S0,S1,S2}": 80
          }
        ],
        "key_columns": [
          "time_2_node",
          "S2",
          "(S2-70)^+",
          "max{S0,S1,S2}"
        ]
      },
      {
        "id": "Table 2.5",
        "description": "Conditional expectations of S_2 against different filtration values under measure P (equal-weights).",
        "key_rows": [
          {
            "expectation": "E_P(S2 | F0)",
            "filtration_value": "{1}",
            "value": 92
          },
          {
            "expectation": "E_P(S2 | F1)",
            "filtration_value": "{1,3}",
            "value": 130
          },
          {
            "expectation": "E_P(S2 | F1)",
            "filtration_value": "{1,2}",
            "value": 54
          },
          {
            "expectation": "E_P(S2 | F2)",
            "filtration_value": "{1,3,7}",
            "value": 180
          },
          {
            "expectation": "E_P(S2 | F2)",
            "filtration_value": "{1,3,6}",
            "value": 80
          },
          {
            "expectation": "E_P(S2 | F2)",
            "filtration_value": "{1,2,5}",
            "value": 72
          },
          {
            "expectation": "E_P(S2 | F2)",
            "filtration_value": "{1,2,4}",
            "value": 36
          }
        ],
        "key_columns": [
          "expectation",
          "filtration_value",
          "value"
        ]
      }
    ]
  },
  {
    "chunk_summary": "Pages 7–9 cover (1) viewing conditional expectation as a time-indexed process and (2) the definition and intuition for previsible (predictable) processes on a binomial tree. The slides show how a claim (example: X = S_2) can be transformed into the conditional-expectation process E_Q[X | F_i] (figure 2.11), i.e., values at each time that depend on the current filtration. They then define a previsible process φ_i as a process whose value at time i is determined solely by the history up to time i−1 (F_{i−1}), give examples (bond price process B_i; delayed price φ_i = S_{i−1}), and note that previsible processes only react to branches one step after they occur and that defining their value at time 0 may not always be sensible.",
    "key_definitions": [
      {
        "term": "Conditional expectation operator",
        "definition": "E_Q(· | F_i) extends expectation to include both a probability/ pricing measure Q and a history (filtration) F_i. It gives the expected value of a future claim conditioned on the information available at time i.",
        "source_page": 7
      },
      {
        "term": "Conditional expectation process",
        "definition": "Given a claim X and a measure Q, the process E_i := E_Q[X | F_i] (indexed by i) is the time-evolution of the conditional expectation of X; it is the conversion of a terminal random variable into a process adapted to the filtration.",
        "source_page": 7
      },
      {
        "term": "Previsible (predictable) process",
        "definition": "A process φ = (φ_i) is previsible if for every time i its value φ_i is determined by the history up to the previous tick, i.e. φ_i is F_{i-1}-measurable. Thus the value at time i is known one step earlier.",
        "source_pages": 8,
        "note": "Previsible processes are defined at nodes later than time 0; their time-0 value may be undefined or not sensible."
      },
      {
        "term": "Delayed price process (example)",
        "definition": "The delayed price process is φ_i = S_{i-1} (for i ≥ 1), i.e. using the previous time's stock price as the current process value; this is previsible because it depends only on past information.",
        "source_page": 9
      },
      {
        "term": "Previsibility intuition",
        "definition": "Previsibility means the process's value at time i is 'known' given the history up to time i−1; it is closely related to predictability and formalized as measurability with respect to the prior filtration.",
        "source_page": 8
      }
    ],
    "theorems": [],
    "equations": [
      {
        "latex": "E_{\\mathbb{Q}}\\big[X\\mid\\mathcal{F}_i\\big]",
        "meaning": "Conditional expectation of random variable X under measure Q given the filtration F_i.",
        "intuition": "This is the best forecast (in L^2/expectation sense) of X using only information available at time i; when indexed by i it produces a process adapted to the filtration."
      },
      {
        "latex": "E_{\\mathbb{P}}(S_2\\mid\\mathcal{F}_2)=S_2",
        "meaning": "If you condition on the full filtration at the terminal time (F_2), the conditional expectation equals the realized terminal value.",
        "intuition": "When you already know the terminal node (full information at maturity), the expected value of the terminal payoff is the payoff itself."
      },
      {
        "latex": "\\phi_i\\ \\text{is }\\mathcal{F}_{i-1}\\text{-measurable}",
        "meaning": "Previsibility condition: the value φ_i at time i depends only on past information (filtration up to time i−1).",
        "intuition": "φ_i is set based on yesterday's history; it cannot react to the random event that occurs at time i until the next step."
      },
      {
        "latex": "E_i:=E_{\\mathbb{Q}}[X\\mid\\mathcal{F}_i],\\quad i=0,1,\\dots",
        "meaning": "Definition of the conditional-expectation process E_i constructed from terminal claim X under measure Q.",
        "intuition": "This process traces how the market's best (measure-Q) estimate of the claim evolves as more information arrives over time."
      }
    ],
    "figures": [
      {
        "id": "Figure 2.11",
        "type": "tree/flow diagram",
        "description": "Conditional-expectation process E_{P}(S_2 | F_i) illustrated on a 3-time-step tree. Time axis: 0→1→2. Node values shown approximate the conditional expectations: E_0 = 92 at time 0; at time 1 the two conditional values are 130 (up-branch) and 54 (down-branch); leaves at time 2 are the realized S_2 outcomes (180, 80, 72, 36).",
        "axes": {
          "x": "discrete time ticks (time 0, 1, 2)",
          "y": "process value / conditional expectation (monetary units)"
        },
        "trend": "The single root value (92) splits at time 1 into two conditional expectations (130 and 54) which then resolve into realized terminal outcomes at time 2.",
        "significance": "Visualizes converting a terminal claim (S_2) into a time-indexed conditional-expectation process; demonstrates how expectations change with filtration and that conditioning on full information yields the realized payoff."
      },
      {
        "id": "Figure 2.12",
        "type": "tree/flow diagram",
        "description": "Example of a previsible process (the delayed price S_{i-1}). The value at each time i equals the stock price from the previous tick, so branches at a given time share the same φ value determined by prior history.",
        "axes": {
          "x": "discrete time ticks (time 0, 1, 2)",
          "y": "process value (stock price used with one-step delay)"
        },
        "trend": "Because values are taken from the previous step, the process does not split at the same time-step where stock branching occurs — identical values across branches until the next time tick.",
        "significance": "Illustrates the key property of previsible processes: they do not react to the current branching event until the following step and are therefore determined by past information."
      }
    ],
    "tables": []
  },
  {
    "chunk_summary": "Pages 10–12 cover the notion of previsibility (predictability) for processes and introduce martingales. Previsibility: a process is known from past history (filtration) and is distinct from the martingale property. Martingale: a process S is a martingale under a measure P (with respect to a filtration) iff future conditional expectations equal the current value. Examples illustrate the martingale property using a small binomial price tree and a chosen risk-neutral-type measure Q with non-uniform branch probabilities that make the price process a Q-martingale.",
    "key_definitions": [
      {
        "term": "Previsible (previsibility)",
        "definition": "A process whose value at each time is determined by the history up to (typically) the previous time tick (the filtration). Informally: its value is 'known' given the history so far. Technically discussed in relation to measurability/adaptedness to the filtration.",
        "page": 10
      },
      {
        "term": "Filtration (F_i)",
        "definition": "The history (information) available up to time i on the tree; the sigma-algebra of events determined by past nodes/paths up to i.",
        "page": 10
      },
      {
        "term": "Martingale",
        "definition": "A stochastic process S is a martingale with respect to a measure P and a filtration (F_i) if the conditional expectation of any future value given current history equals the current value: E_P[S_j | F_i] = S_i for all i ≤ j. Intuitively the process has no drift and no predictable gain under P.",
        "page": 11
      }
    ],
    "theorems": [
      {
        "name": "Martingale property (definition/formulation)",
        "statement": "A process S is a martingale w.r.t. measure P and filtration (F_i) iff E_P(S_j | F_i) = S_i for all i ≤ j.",
        "page": 11
      }
    ],
    "equations": [
      {
        "latex": "E_{\\mathbb{P}}\\left[S_j\\mid\\mathcal{F}_i\\right]=S_i,\\quad\\forall\\ i\\le j",
        "meaning": "Martingale condition: conditional expectation of future value S_j given current history F_i equals current value S_i.",
        "intuition": "Under the given measure P, knowing the past gives no advantage — the best forecast of future S is the current S; there is no drift."
      },
      {
        "latex": "E_{\\mathbb{Q}}\\left[S_1\\mid\\mathcal{F}_0\\right]=\\tfrac{1}{3}\\cdot120+\\tfrac{2}{3}\\cdot60=80",
        "meaning": "Numerical check that, under the measure Q used in the example, the one-step conditional expectation equals the root price S_0 (=80).",
        "intuition": "Choose branch probabilities so that the weighted average of up/down prices equals the current price, demonstrating the martingale property under Q."
      },
      {
        "latex": "E_{\\mathbb{Q}}\\left[S_2\\mid\\mathcal{F}_1\\right]=\\tfrac{2}{5}\\cdot180+\\tfrac{3}{5}\\cdot80=120",
        "meaning": "Numerical check at the 'up' node at time 1: expected S_2 under Q equals the node value S_1 (=120).",
        "intuition": "At each node the conditional expectation (with appropriate local transition probabilities) matches the node's price, confirming local martingale property."
      }
    ],
    "figures": [
      {
        "id": "Figure 2.9",
        "type": "Binomial price tree (discrete-time node diagram)",
        "description": "A small binomial tree showing stock prices at times 0,1,2. Example values (as shown): time 0: 80; time 1 up: 120, down: 60; time 2 nodes include 180 and 80 (from up) and 72 and 36 (from down).",
        "axes": "Horizontal axis: discrete time steps (time 0, 1, 2). Nodes labeled with stock price values (vertical is qualitative/branching, not a continuous numeric axis).",
        "trend": "Up and down branches generate higher or lower prices respectively; the tree displays possible future price paths and terminal values.",
        "significance": "Provides the price-state geometry used to compute conditional expectations and to illustrate the martingale property under a chosen measure."
      },
      {
        "id": "Figure 2.10b",
        "type": "Transition-probability tree (measure Q)",
        "description": "A tree annotated with branch probabilities under measure Q. At the root the up/down probabilities are 1/3 and 2/3; at the subsequent nodes the local conditional probabilities are shown (e.g., 2/5 and 3/5 on the 'up' branch) so that local conditional expectations reproduce node prices.",
        "axes": "Horizontal axis: discrete time steps (time 0,1,2). Branches labeled with transition probabilities.",
        "trend": "Probabilities are asymmetric (not 1/2 each); they are set so weighted averages of child node prices equal the parent node price (martingale condition).",
        "significance": "Illustrates a specific measure Q that makes the price tree a martingale — used in the numerical examples verifying E_Q[S_{next}|current] = current."
      }
    ],
    "tables": []
  },
  {
    "chunk_summary": "Pages 13–15 present examples and the key property that conditional-expectation processes are martingales. Page 13 verifies via a numeric example (using the binomial tree shown in Figure 2.11) that the conditional-expectation process N_i = E_P(S_2 | F_i) satisfies the martingale property (E_P(N_1 | F_0) = N_0). Page 14 states the general result: for any claim X the process E_P(X | F_i) is a P-martingale, and it introduces the tower law identity E_P(E_P(X | F_j) | F_i) = E_P(X | F_i) (i <= j). The slide also explains how to test whether a process S is a P-martingale by comparing S_i to E_P(S_T | F_i). Page 15 restates the tower-law interpretation: the conditional-expectation process of a claim is always a martingale.",
    "key_definitions": [
      {
        "term": "Conditional-expectation process (of a claim)",
        "definition": "Given a measure P and a claim X maturing at T, the conditional-expectation process is the sequence E_i := E_P(X | F_i) for i = 0,...,T.",
        "notes": "This process is constructed by taking conditional expectations of the terminal claim under the chosen measure and filtration."
      },
      {
        "term": "Martingale (in context)",
        "definition": "A process M is a P-martingale with respect to filtration F_i if for all i <= j, E_P(M_j | F_i) = M_i.",
        "notes": "Pages 13–15 use this definition to show the conditional-expectation process is a martingale."
      },
      {
        "term": "Tower law",
        "definition": "The identity E_P(E_P(X | F_j) | F_i) = E_P(X | F_i) for i <= j.",
        "notes": "Interpreted as: conditioning first on a later history and then on an earlier history yields the same result as conditioning directly on the earlier history."
      }
    ],
    "theorems": [
      {
        "name": "Conditional-expectation process is a martingale",
        "statement": "For any claim X (a terminal measurable random variable), the process E_i := E_P(X | F_i) is a P-martingale: for all i <= j, E_P(E_j | F_i) = E_i.",
        "conditions": "Requires a probability measure P and a filtration (F_i) on the underlying probability space; X must be integrable so conditional expectations exist.",
        "consequence": "The conditional-expectation process has no drift under P and can be used as a martingale in proofs and hedging constructions; it also underpins the tower law."
      },
      {
        "name": "Tower law (iterated expectation)",
        "statement": "E_P(E_P(X | F_j) | F_i) = E_P(X | F_i) for i <= j.",
        "conditions": "Same measurability/integrability assumptions that allow conditional expectations.",
        "consequence": "Allows reduction of nested conditioning and is the key technical fact used to prove the conditional-expectation process is a martingale and to verify martingale properties."
      }
    ],
    "equations": [
      {
        "latex": "E_P(N_1 \\mid F_0) = N_0",
        "meaning": "Martingale verification for the conditional-expectation process N: the expectation at time 1 conditional on the time-0 filtration equals the time-0 value.",
        "intuition": "The best forecast at time 0 of the time-1 conditional expectation equals the time-0 conditional expectation itself (no predictable drift)."
      },
      {
        "latex": "E_P\\big(N_1 \\mid F_0\\big) = \\tfrac{1}{2}(130) + \\tfrac{1}{2}(54) = 92",
        "meaning": "Numeric check from the binomial-tree example showing the conditional expectation computation gives 92, which matches N_0 (the root value).",
        "intuition": "A concrete computation demonstrating the martingale property: average of the two time-1 conditional-expectation values (weighted by probabilities under P) equals the time-0 value."
      },
      {
        "latex": "E_P\\big(E_P(X \\mid F_j) \\mid F_i\\big) = E_P(X \\mid F_i),\\quad i\\le j",
        "meaning": "The tower law (iterated expectation): conditioning on a larger sigma-field then on a smaller one reduces to conditioning directly on the smaller.",
        "intuition": "Information added and then removed (conditioning on future then past) yields the same past-conditioned expectation; nested conditioning collapses."
      },
      {
        "latex": "E_P(S_j \\mid F_i) = S_i \\quad(\\text{martingale definition, }i\\le j)",
        "meaning": "General martingale property used as a reference: the conditional expectation of future value equals current value.",
        "intuition": "If S is a martingale, knowing the present gives the best forecast of the future — there is no predictable gain or loss."
      }
    ],
    "figures": [
      {
        "id": "Figure 2.11",
        "type": "binomial tree / process diagram",
        "description": "Conditional-expectation process E_P(S_2 | F_i) drawn on a 3-time-node binomial tree: root value 92 at time 0, branching to 130 (up) and 54 (down) at time 1, and final stock prices at time 2 (180, 80, 72, 36) at the leaves.",
        "axes": "Horizontal axis: time ticks (time 0, time 1, time 2). Vertical axis: process / price values (numeric stock/expectation values).",
        "trend": "Root expectation 92 splits into two conditional expectations 130 and 54 at the next tick, which then map to the terminal node prices at time 2; the expected value at the root equals the probability-weighted average of the next-step expectations (martingale property).",
        "significance": "Visual demonstration that the conditional-expectation process is a martingale: the time-0 value equals the conditional expectation of the time-1 values (shown numerically on the tree)."
      }
    ],
    "tables": []
  },
  {
    "chunk_summary": "Pages 16–18 cover (1) the notion that a probability measure Q that makes the (discounted) binomial stock process S a martingale is called the martingale measure for S; (2) the Binomial Representation Theorem (BRT): under a measure Q for which S is a Q-martingale, any other Q-martingale N can be written as N_i = N_0 + sum_{k=1}^i φ_k ΔS_k for a previsible process φ; and (3) the intuitive idea behind BRT: two martingales under the same measure can be related by a previsible scaling of increments (matching branch widths and offsets), so one process can be replicated from the other. The slides emphasize the role of previsibility (φ known given the prior filtration) and that ΔS scaling suffices when both processes have zero conditional drift under Q.",
    "key_definitions": [
      {
        "term": "martingale measure (Q)",
        "definition": "A probability measure Q under which the (discounted) stock process S is a martingale. Under Q, S has no conditional drift: its conditional expectation at future times equals the current value.",
        "source_page": 16
      },
      {
        "term": "Q-martingale",
        "definition": "A stochastic process M is a Q-martingale with respect to a filtration if for all i ≤ j, E_Q[M_j | F_i] = M_i. That is, given the past, the best conditional forecast of the future value equals the current value.",
        "source_page": 16
      },
      {
        "term": "previsible process (φ)",
        "definition": "A process φ = (φ_i) is previsible if the value φ_i at tick i is measurable with respect to the filtration one step earlier (F_{i-1}); equivalently, φ_i is known at time i−1. In BRT φ is chosen node-by-node based only on prior history.",
        "source_page": 17
      },
      {
        "term": "increment (ΔS_k)",
        "definition": "The change in the stock process over one tick: ΔS_k := S_k − S_{k−1}. (It describes the 'width' of the branch at step k.)",
        "source_page": 17
      },
      {
        "term": "Binomial Representation Theorem (informal)",
        "definition": "If S is a Q-martingale on a binomial tree and N is any other Q-martingale on the same tree, then N can be represented as an initial value plus a sum of previsible multiples of S-increments: N_i = N_0 + Σ_{k=1}^i φ_k ΔS_k, with φ previsible.",
        "source_page": 17
      }
    ],
    "theorems": [
      {
        "id": "Binomial Representation Theorem",
        "statement": "Suppose Q is a measure such that the binomial price process S is a Q-martingale. If N is any other Q-martingale, then there exists a previsible process φ such that for each i, N_i = N_0 + Σ_{k=1}^i φ_k ΔS_k, where ΔS_k := S_k − S_{k−1} and φ_k is the value of φ at the relevant node at tick-time k.",
        "conditions": [
          "Both S and N are defined on the same binomial tree and adapted to the same filtration.",
          "S and N are Q-martingales (zero conditional drift under Q).",
          "φ is previsible (φ_k is measurable with respect to F_{k-1})."
        ],
        "consequence": "Any Q-martingale N can be replicated/constructed by a self-financing strategy that trades φ_k units of the stock across each branch (up/down) — i.e., N is a stochastic integral (sum) of φ against ΔS.",
        "source_page": 17
      }
    ],
    "equations": [
      {
        "latex": "N_i = N_0 + \\sum_{k=1}^i \\phi_k\\,\\Delta S_k",
        "meaning": "Representation of any Q-martingale N as the initial value N_0 plus the cumulative gains from holding φ_k units of the stock across each tick, where ΔS_k are the stock increments.",
        "intuition": "At each step k choose φ_k (based only on prior information) so that the scaled increments of S reproduce the increment of N; summing these gives N. This is analogous to expressing one vector in a coordinate system defined by another."
      },
      {
        "latex": "\\Delta S_k := S_k - S_{k-1}",
        "meaning": "Definition of the increment of the stock process over one tick.",
        "intuition": "The branch 'width' — difference between up and down node values at that step — which φ_k will scale to match N's branch width."
      },
      {
        "latex": "\\text{(martingale property) } E_Q[S_j\\mid\\mathcal{F}_i] = S_i \\quad (i\\le j)",
        "meaning": "Under the martingale measure Q, the conditional expectation of future S given the present filtration equals the current S; S has no predictable drift under Q.",
        "intuition": "Future expected change is zero given current information, so increments ΔS have zero conditional mean; this property forces any offset when representing another martingale to be zero, leaving only a scaling by φ."
      }
    ],
    "figures": [
      {
        "id": "Figure 2.9",
        "type": "binomial tree (price process)",
        "description": "A 2-step binomial tree showing stock price nodes: time 0 value branching to time 1 and then time 2 nodes with numerical prices (e.g., 80 → 120/60 → 180/80/72/36).",
        "axes": "Horizontal axis: discrete time steps (time 0, 1, 2). Vertical/layout: node values representing stock price at each node (not continuous axes—node diagram).",
        "trend": "Tree branches show up/down moves with resulting different stock values at each terminal node; overall illustrates possible price evolutions over two ticks.",
        "significance": "Illustrates the underlying binomial price process S used in examples and in the statement of the BRT; visualizes branch widths (ΔS) that φ must match."
      },
      {
        "id": "Figure 2.11",
        "type": "conditional expectation tree",
        "description": "A 2-step tree showing the conditional expectation process E_Q(S_2 | F_i) as node values: central root value (e.g., 92) branching to intermediate expected values (e.g., 130 and 54) then to terminal S_2 values (180,80,72,36).",
        "axes": "Horizontal axis: discrete time (0,1,2). Vertical/layout: node values showing conditional expectations or process values at each time/node.",
        "trend": "Intermediate nodes show conditional expectations that lie between terminal extremes; root gives unconditional expectation.",
        "significance": "Demonstrates how a claim (or terminal value) can be converted into a martingale process via conditional expectation; used to motivate BRT and to contrast the raw price tree (Figure 2.9) with an expectation-process tree."
      }
    ],
    "tables": []
  },
  {
    "chunk_summary": "Pages 19–21 present the local proof steps of the Binomial Representation Theorem. The argument focuses on a single branch (node at time i-1 splitting to two nodes at time i), defines the branch increments for the stock process S and another martingale process N, and introduces the branch widths (differences between up and down values). A previsible scalar φ_i is defined as the ratio of the branch widths (δn_i/δs_i). One writes the N-increment as a scaled S-increment plus an offset (ΔN_i = φ_i ΔS_i + k) where φ_i and k are F_{i-1}-measurable. Because both S and N are Q-martingales, their conditional increments have zero expectation; since φ_i is previsible, E_Q[φ_i ΔS_i | F_{i-1}] = 0, which forces k = 0. Thus locally ΔN_i = φ_i ΔS_i. Chaining these local relations across time gives the global representation N_i = N_0 + Σ_{k=1}^i φ_k ΔS_k with φ previsible. The slides emphasize geometry of the branch, price scaling, time-shift argument, and how martingale and previsibility properties remove the offset term.",
    "key_definitions": {
      "branch_increment_delta_S": {
        "symbol": "\\Delta S_i",
        "definition": "Increment of the stock process over the branch from time i-1 to i: S_i - S_{i-1}."
      },
      "branch_increment_delta_N": {
        "symbol": "\\Delta N_i",
        "definition": "Increment of the martingale process N over the same branch: N_i - N_{i-1}."
      },
      "branch_widths": {
        "symbols": "\\delta s_i, \\delta n_i",
        "definition": "Widths of the up-down branch for each process: δs_i = s_up - s_down and δn_i = n_up - n_down (values conditional on F_{i-1})."
      },
      "previsible_process_phi": {
        "symbol": "\\phi_i",
        "definition": "A process that is measurable w.r.t. the history up to time i-1 (F_{i-1}); defined locally as the ratio of branch widths φ_i = δn_i / δs_i."
      },
      "previsible": {
        "definition": "Property of a process whose value at time i is determined by the filtration up to time i-1 (known one step in advance)."
      },
      "martingale_property": {
        "definition": "A process M is a Q-martingale w.r.t filtration F if E_Q[M_j | F_i] = M_i for all i ≤ j; equivalently conditional increments have zero expectation: E_Q[ΔM_i | F_{i-1}] = 0."
      },
      "filtration": {
        "symbol": "F_{i-1}",
        "definition": "History (sigma-field) up to time i-1 that fixes the node and branches available at that time."
      }
    },
    "theorems": [
      {
        "name": "Binomial Representation Theorem (local proof segment)",
        "statement": "If the binomial price process S is a Q-martingale and N is any other Q-martingale on the same binomial tree, then there exists a previsible process φ such that for every time i, N_i = N_0 + \\sum_{k=1}^i φ_k \\Delta S_k.",
        "proof_sketch": "Focus on a single branch from time i-1 to i. Define ΔS_i and ΔN_i and their branch widths δs_i and δn_i. Set φ_i = δn_i/δs_i (previsible). Write ΔN_i = φ_i ΔS_i + k with φ_i and k measurable w.r.t. F_{i-1}. Because S and N are Q-martingales, E_Q[ΔN_i | F_{i-1}] = 0 and E_Q[ΔS_i | F_{i-1}] = 0. Previsibility of φ_i implies E_Q[φ_i ΔS_i | F_{i-1}] = 0, hence k = 0. Thus ΔN_i = φ_i ΔS_i on that branch. Repeating across all times and summing yields the stated representation."
      }
    ],
    "equations": [
      {
        "latex": "\\Delta S_i := S_i - S_{i-1}",
        "meaning": "Definition: the change in the stock process over the branch from time i-1 to i.",
        "intuition": "The elementary upward/downward move of the stock on a single time-step; the basic incremental unit used in local replication."
      },
      {
        "latex": "\\Delta N_i := N_i - N_{i-1}",
        "meaning": "Definition: the change in the martingale process N over the same branch.",
        "intuition": "How the target martingale (e.g., an attainable claim's conditional expectation) changes over that time-step."
      },
      {
        "latex": "\\delta s_i = s_{\\text{up}} - s_{\\text{down}}, \\qquad \\delta n_i = n_{\\text{up}} - n_{\\text{down}}",
        "meaning": "Branch widths: the difference between the up and down node values for S and N respectively (both are F_{i-1}-measurable quantities).",
        "intuition": "These widths measure the 'range' or variability of each process on the branch; they are used to match the magnitudes of moves between processes."
      },
      {
        "latex": "\\phi_i = \\frac{\\delta n_i}{\\delta s_i}",
        "meaning": "Previsible scaling factor defined as the ratio of N's branch width to S's branch width, known at time i-1.",
        "intuition": "Choose φ so that the up-minus-down change in N equals φ times the up-minus-down change in S; this matches the local amplitudes of the two processes."
      },
      {
        "latex": "\\Delta N_i = \\phi_i\\,\\Delta S_i + k,\\quad\\text{with }\\phi_i, k\\ \\text{F}_{i-1}\\text{-measurable}",
        "meaning": "An ansatz: the increment of N is given by a scaled increment of S plus an offset k, both determined by the known history up to time i-1.",
        "intuition": "Decompose N's move into a component explained by holding φ_i units of S and a leftover offset; goal is to show the offset vanishes under martingale assumptions."
      },
      {
        "latex": "\\mathbb{E}_Q[\\Delta N_i\\mid\\mathcal{F}_{i-1}] = 0,\\qquad \\mathbb{E}_Q[\\Delta S_i\\mid\\mathcal{F}_{i-1}] = 0",
        "meaning": "Martingale property for N and S under measure Q: conditional expectations of their increments are zero.",
        "intuition": "Under the martingale measure, there is no predictable drift; future expected changes given the past are zero."
      },
      {
        "latex": "\\mathbb{E}_Q[\\phi_i\\Delta S_i\\mid\\mathcal{F}_{i-1}] = 0",
        "meaning": "Because φ_i is F_{i-1}-measurable (previsible) and E_Q[ΔS_i | F_{i-1}] = 0, the expected value of φ_i ΔS_i conditional on F_{i-1} is zero.",
        "intuition": "Scaling a zero-mean increment by a known constant preserves the zero conditional mean."
      },
      {
        "latex": "0 = \\mathbb{E}_Q[\\Delta N_i\\mid\\mathcal{F}_{i-1}] = \\mathbb{E}_Q[\\phi_i\\Delta S_i + k\\mid\\mathcal{F}_{i-1}] = 0 + k \\;\\Rightarrow\\; k = 0",
        "meaning": "Taking conditional expectations of the decomposition shows the offset k must be zero.",
        "intuition": "No residual predictable offset can remain if both increments have zero conditional mean and the scaling term contributes zero; therefore ΔN_i is exactly the scaled ΔS_i."
      },
      {
        "latex": "\\Delta N_i = \\phi_i\\,\\Delta S_i",
        "meaning": "Local equality of increments once k is shown to be zero.",
        "intuition": "Locally on each branch, holding φ_i units of S replicates the increment of N; this is the step that builds the global representation by summation."
      },
      {
        "latex": "N_i = N_0 + \\sum_{k=1}^i \\phi_k\\,\\Delta S_k",
        "meaning": "Global binomial representation: N is obtained from N_0 by cumulative gains from holding φ_k shares of S across time.",
        "intuition": "Summing the per-step replication relations yields the full pathwise construction of N from the stock increments via a previsible strategy φ."
      }
    ],
    "figures": [
      {
        "id": "Figure 2.13",
        "type": "branch diagram / tree",
        "description": "Diagram illustrating a single branch (time i-1 to i) for two processes: on the left the stock branch nodes s_now -> s_up, s_down; on the right the corresponding nodes for the other process n_now -> n_up, n_down. The figure labels the up and down nodes used to define branch widths and increments.",
        "axes": null,
        "trend": "Shows a binary split (up/down) from a single prior node into two possible next-step nodes for both processes; no continuous axes—discrete branching.",
        "significance": "Visualizes the local geometry used in the proof: how the two processes vary along the same branch so that one can define branch widths, set φ as their ratio, and compare conditional expectations to eliminate offsets."
      }
    ],
    "tables": []
  },
  {
    "chunk_summary": "Pages 22–24 complete the proof of the Binomial Representation Theorem and explain its direct financial application and practical challenges. The proof concludes that when S and N are martingales under the same measure Q, the increments of N over each branch are a predictable scalar multiple of the increments of S (ΔN_i = φ_i ΔS_i) because the predictable scaling φ_i has zero conditional expectation times ΔS_i, forcing any additive offset to vanish. Financially, if there exists a martingale measure Q that makes the discounted stock a Q-martingale, the theorem yields a previsible trading rule φ that can be interpreted as the number of stock units to hold so that one martingale (a suitably discounted claim) can be replicated by trading in S (and a bond). Practical challenges noted: a claim X is a terminal random variable (not initially a process), and replication generally requires holdings in both stock and a cash-bond (φ_i for stock and ψ_i for bond).",
    "key_definitions": [
      {
        "term": "ΔS_i",
        "definition": "Increment of the stock process from tick i-1 to i: ΔS_i := S_i − S_{i−1}.",
        "source_page": 22
      },
      {
        "term": "ΔN_i",
        "definition": "Increment of another process N from tick i-1 to i: ΔN_i := N_i − N_{i−1}.",
        "source_page": 22
      },
      {
        "term": "Previsible (predictable) process φ_i",
        "definition": "A process whose value at time i is measurable with respect to the history up to time i−1 (known at time i−1). Here φ_i is the scaling factor chosen based on filtration F_{i−1}.",
        "source_page": 22
      },
      {
        "term": "Claim X",
        "definition": "A random variable defined at maturity T (terminal payoff); not initially a process — can be converted to a martingale (process) by taking conditional expectations under a chosen measure Q.",
        "source_page": 24
      },
      {
        "term": "ψ_i",
        "definition": "Notation for the number of units held in the cash bond at (or chosen for) time step i (used alongside φ_i to account for bond holdings in a replication strategy).",
        "source_page": 24
      }
    ],
    "theorems": [
      {
        "name": "Binomial Representation Theorem (local conclusion on pages 22–24)",
        "statement": "If S and N are martingales under the same measure Q on a binomial tree, then at each time step i there exists a previsible scalar φ_i (known at time i−1) such that the increment of N equals that scalar times the increment of S: ΔN_i = φ_i ΔS_i. Globally, this yields N_i = N_0 + Σ_{k=1}^i φ_k ΔS_k.",
        "consequence_intuition": "Two Q-martingales live in the same martingale \"space\" so one can be expressed in a predictable linear combination of the increments of the other. Financially this provides the previsible trading ratio (φ) needed to replicate one martingale by trading in the other (stock) — foundation for self-financing replication/hedging."
      }
    ],
    "equations": [
      {
        "latex": "\\Delta N_i = \\phi_i \\Delta S_i + k",
        "meaning": "Intermediate ansatz in the proof: the increment of N over the branch is a scaled increment of S plus an offset k which is measurable w.r.t. the previous history F_{i-1}.",
        "intuition": "We allow for both a multiplicative scaling and an additive offset determined by prior information; the goal is to show the offset must be zero when both processes are Q-martingales and φ_i is previsible."
      },
      {
        "latex": "\\mathbb{E}_Q[\\Delta N_i\\mid \\mathcal{F}_{i-1}] = 0,\\quad \\mathbb{E}_Q[\\Delta S_i\\mid \\mathcal{F}_{i-1}] = 0",
        "meaning": "Martingale property for increments: conditional on the prior filtration, the expected increments of both N and S are zero under Q.",
        "intuition": "Because both processes are Q-martingales, their conditional expected increments vanish; this fact is used to force the additive offset k to be zero in the previous equation."
      },
      {
        "latex": "\\mathbb{E}_Q[\\phi_i\\Delta S_i\\mid\\mathcal{F}_{i-1}] = 0",
        "meaning": "Since φ_i is previsible (measurable with respect to F_{i-1}), it can be pulled outside the conditional expectation, so the expectation of φ_iΔS_i is φ_i times the expectation of ΔS_i (which is zero).",
        "intuition": "Because φ_i is known at time i−1, it cannot introduce a nonzero expected increment; this is the key step that forces k=0 in the decomposition of ΔN_i."
      },
      {
        "latex": "\\Delta N_i = \\phi_i \\Delta S_i",
        "meaning": "Final result for each time-step: the increment of N equals the predictable scalar multiple of the increment of S (no additive offset).",
        "intuition": "With k=0, N's local moves are exactly matched by scaled moves of S; summing these local relations over time reconstructs N from S via a predictable trading strategy φ."
      },
      {
        "latex": "N_i = N_0 + \\sum_{k=1}^{i} \\phi_k \\Delta S_k",
        "meaning": "Global (summed) representation: any Q-martingale N can be written as its initial value plus the cumulative gains from holding φ_k units of stock across steps.",
        "intuition": "This is the discrete-time replication formula: a previsible trading strategy in S reproduces the evolution of N exactly."
      }
    ],
    "figures": [],
    "tables": []
  },
  {
    "chunk_summary": "Pages 25–27 describe how to turn a terminal claim (a random variable) into a martingale process via conditional expectation under a chosen measure Q, introduce the cash-bond and the associated discounting, and apply the Binomial Representation Theorem (BRT) to the discounted-claim martingale. Concretely: given a measure Q under which the discounted stock Z_t = B_t^{-1} S_t is a Q-martingale, the discounted claim B_T^{-1} X produces a Q-martingale E_t = E^Q[B_T^{-1} X | F_t]. By the BRT there exists a previsible trading strategy phi such that E_t = E_0 + sum_{k=1}^t phi_k ΔZ_k. This sets up the link between an abstract martingale representation and a realizable hedging strategy (phi corresponds to holdings in the traded (discounted) stock), which is the core step used to price and replicate the claim X in the binomial model.",
    "key_definitions": {
      "claim_X": "A random variable defined on the nodes at maturity T representing the payoff to be delivered at T.",
      "conditional_expectation_process_E": "E_t := E^Q[B_T^{-1} X | F_t], the process obtained by taking conditional expectation (under Q) of the discounted terminal claim; E is a Q-martingale.",
      "cash_bond_B": "B_t denotes the value at time t of one unit of money invested in the risk-free (cash) bond; B_0 = 1. B_t is previsible and positive.",
      "discount_process": "B_t^{-1}, the inverse of the bond process; used to discount future cashflows to current units.",
      "discounted_stock_Z": "Z_t := B_t^{-1} S_t, the stock price expressed in discounted (bond) units; observed on the same binomial tree as S.",
      "discounted_claim": "B_T^{-1} X, the claim payoff at T expressed in discounted units; this is a claim on Z (and S via mapping).",
      "previsible_process_phi": "A process phi_t whose value at time t is measurable with respect to the history up to time t-1 (F_{t-1}); it represents a trading strategy that depends only on past information.",
      "Q-martingale": "A stochastic process M_t is a Q-martingale w.r.t. a filtration F_t if E^Q[M_j | F_i] = M_i for all i <= j (i.e., the conditional expectation equals the current value)."
    },
    "theorems": [
      {
        "id": "Binomial Representation Theorem (applied)",
        "statement": "If Q is a measure under which the discounted stock Z is a Q-martingale, then for any claim X the discounted terminal payoff B_T^{-1} X produces a Q-martingale E_t = E^Q[B_T^{-1} X | F_t]. By the Binomial Representation Theorem, there exists a previsible process phi such that E_t = E_0 + sum_{k=1}^t phi_k ΔZ_k.",
        "implication": "This provides a representation of the discounted claim-martingale as gains from trading the discounted stock with a previsible strategy phi; phi therefore gives the hedging/replication strategy for the claim in the binomial model."
      }
    ],
    "equations": [
      {
        "latex": "E_t = \\mathbb{E}^Q[X\\,|\\,\\mathcal{F}_t]",
        "meaning": "The conditional-expectation process (under measure Q) that turns the terminal claim X into a process adapted to the filtration; when X is already discounted the same relation applies to the discounted claim.",
        "intuition": "Given the information up to time t, the best Q-expected value of the terminal payoff is a time-t price estimate; repeating this for each t yields a martingale process."
      },
      {
        "latex": "Z_t := B_t^{-1} S_t",
        "meaning": "Definition of the discounted stock price process: the stock price expressed in units of the cash bond.",
        "intuition": "Discounting the stock by the bond removes deterministic growth from the cash account so that under the correct measure Q the discounted stock behaves like a martingale (no drift)."
      },
      {
        "latex": "E_t = \\mathbb{E}^Q\\big[B_T^{-1} X\\,|\\,\\mathcal{F}_t\\big]",
        "meaning": "The martingale process obtained by taking conditional expectation (under Q) of the discounted claim B_T^{-1} X.",
        "intuition": "Discount the payoff first, then compute its best forecast at each time given current information; this yields a martingale in discounted units."
      },
      {
        "latex": "E_t = E_0 + \\sum_{k=1}^t \\phi_k\\,\\Delta Z_k \\quad\\text{where }\\Delta Z_k:=Z_k-Z_{k-1}",
        "meaning": "Representation of the discounted-claim martingale as an initial value plus cumulative gains from a previsible holding phi in the discounted stock increments.",
        "intuition": "Any Q-martingale in the binomial setting can be replicated by dynamically trading the discounted stock: choose phi_k (based on past information) so that cumulative trading gains reproduce the martingale increments."
      }
    ],
    "figures": [],
    "tables": []
  },
  {
    "chunk_summary": "Pages 28–30 present a concrete self-financing replication (construction) strategy for a claim X using the previsible process φ (units of stock) and ψ (units of bond) derived from the discounted-claim conditional expectation process E_i = E_Q[B_T^{-1} X | F_i]. At time i one holds the portfolio Π_i consisting of φ_{i+1} units of stock S_i and ψ_{i+1} units of bond where ψ_{i+1} = E_i - φ_{i+1} B_i^{-1} S_i. Evaluating the portfolio at time 0 and time 1 shows Π_0 = B_0 E_0 and Π_0 (after market moves to time 1) = B_1 E_1; similarly Π_1 = B_1 E_1. Hence the portfolio can be rolled forward without external cash (sell Π_0 to form Π_1 regardless of filtration outcome) — i.e. it is self-financing — and at maturity reproduces the payoff X. The slides use the discounted stock Z_i = B_i^{-1} S_i and the fact (from the Binomial Representation Theorem / construction) that E_1 = E_0 + φ_1 ΔZ_1 to show the equalities in portfolio values.",
    "key_definitions": [
      {
        "term": "Π_i (portfolio at tick-time i)",
        "definition": "The trading portfolio at tick-time i consisting of φ_{i+1} units of the stock S_i and ψ_{i+1} units of the cash bond; its opening worth at time i is V_i = Π_i = φ_{i+1} S_i + ψ_{i+1} B_i."
      },
      {
        "term": "φ_{i+1} (previsible stock holding)",
        "definition": "A previsible process giving the number of stock units to hold from time i to i+1; φ_{i+1} is measurable with respect to the history up to time i (F_i)."
      },
      {
        "term": "ψ_{i+1} (bond holding)",
        "definition": "Number of bond units to hold from time i to i+1 chosen so the portfolio tracks the discounted conditional expectation process; at time i defined by ψ_{i+1} = E_i - φ_{i+1} B_i^{-1} S_i."
      },
      {
        "term": "E_i",
        "definition": "The conditional expectation (a Q-martingale) of the discounted terminal claim: E_i = E_Q[B_T^{-1} X | F_i]."
      },
      {
        "term": "Z_i (discounted stock)",
        "definition": "The discounted stock process Z_i := B_i^{-1} S_i used to express holdings and increments in discounted terms."
      },
      {
        "term": "Self-financing (construction in this context)",
        "definition": "A strategy is self-financing if the cost of the portfolio at time i equals the value obtained by rolling forward the previous portfolio (no external funds added/withdrawn); here Π_i costs B_i E_i and Π_{i+1} costs B_{i+1} E_{i+1}, allowing Π_i to be sold to create Π_{i+1} for any realization of the stock."
      }
    ],
    "theorems": [
      {
        "name": "Replication / Self-financing construction (applied result)",
        "statement": "Given a measure Q under which the discounted stock Z is a Q-martingale and given the Q-martingale E_i = E_Q[B_T^{-1} X | F_i], choose a previsible process φ that represents the increments of E in terms of increments of Z (E_1 = E_0 + φ_1 ΔZ_1, etc.). Define ψ_{i+1} = E_i - φ_{i+1} B_i^{-1} S_i and the portfolio Π_i = φ_{i+1} S_i + ψ_{i+1} B_i. Then Π_0 = B_0 E_0 and for each i, the portfolio value equals B_i E_i; the strategy is self-financing and at maturity replicates the claim X.",
        "consequences": "This gives a constructive hedging strategy: initial cost Π_0 = B_0 E_Q[B_T^{-1} X] is the arbitrage-free price, and following φ,ψ yields X at maturity with no additional funding."
      }
    ],
    "equations": [
      {
        "latex": "\\psi_{i+1} = E_i - \\phi_{i+1} B_i^{-1} S_i",
        "meaning": "Definition of the bond holding ψ_{i+1} at time i in terms of the conditional expectation E_i and the chosen stock holding φ_{i+1}.",
        "intuition": "Hold enough bond so that the combined stock-and-bond position equals the dollar value E_i in discounted terms: remove the stock-contribution φ_{i+1}·(S_i/B_i) from E_i to get bond units."
      },
      {
        "latex": "\\Pi_0 = \\phi_1 S_0 + \\psi_1 B_0",
        "meaning": "Initial cost (opening worth) of the time-0 portfolio composed of φ_1 stock units and ψ_1 bond units.",
        "intuition": "Standard portfolio valuation: units times current prices."
      },
      {
        "latex": "Z_i := B_i^{-1} S_i",
        "meaning": "Definition of the discounted stock process Z_i.",
        "intuition": "Work in discounted terms so the bond growth is factored out and martingale relationships under Q become simple."
      },
      {
        "latex": "\\Pi_0 = B_0 E_0 \\quad\\text{and}\\quad \\Pi_0\\text{ (value at time 1) }= B_1 E_1",
        "meaning": "The time-0 portfolio initially costs B_0 E_0; after the market moves to time 1 its value equals B_1 E_1.",
        "intuition": "By construction the portfolio tracks the discounted-expectation process E, so scaling by the bond gives the portfolio’s market value at each date."
      },
      {
        "latex": "E_1 = E_0 + \\phi_1\\,\\Delta Z_1",
        "meaning": "One-step relation between conditional expectations showing that the martingale increment of E equals φ_1 times the increment of the discounted stock Z over the same step.",
        "intuition": "Binomial representation: the Q-martingale E can be represented as gains from trading φ in Z; the change in expected discounted payoff is generated by the chosen stock position times the stock's discounted increment."
      },
      {
        "latex": "\\Pi_1 = \\phi_2 S_1 + \\psi_2 B_1 = B_1 E_1",
        "meaning": "At time 1 the constructed portfolio Π_1 costs B_1 E_1, equal to the value of the rolled-forward Π_0, so no external cash is needed to form Π_1.",
        "intuition": "The strategy is self-financing: the proceeds/value of the previous portfolio exactly fund the next required holdings for all outcomes."
      },
      {
        "latex": "\\Pi_T = B_T B_T^{-1} X = X",
        "meaning": "At maturity T the portfolio value equals the claim X (discounting and re-scaling cancel).",
        "intuition": "The replication is exact: by construction the discounted expectation process culminates in the discounted payoff, so the un-discounted portfolio equals the payoff."
      }
    ],
    "figures": [],
    "tables": []
  },
  {
    "chunk_summary": "Pages 31–33 cover the notion and consequences of self-financing trading strategies in the binomial model and the resulting arbitrage pricing formula. A self-financing portfolio Π_i has opening value V_i and evolves so that its change in value is entirely due to changes in the holdings of the underlying stock S and cash bond B (no external cash flows). The financing gap D_i measures any mismatch between opening value and the cost of holdings; self-financing requires D_i = 0. Under a martingale measure Q for the discounted stock, one can construct a self-financing replicating strategy (φ_i, ψ_i) that duplicates any claim X; hence the no-arbitrage price of X is the Q-expectation of the discounted payoff. The slides state the link B_T E_T = X at maturity and summarize the conditions that guarantee existence of self-financing hedges in the discrete binomial framework.",
    "key_definitions": {
      "V_i (strategy worth / opening value)": "The worth (opening value) of the trading strategy at time i, defined as V_i = φ_{i+1} S_i + ψ_{i+1} B_i (holdings valued at current prices).",
      "Self-financing strategy": "A trading strategy (φ_i, ψ_i) is self-financing if the closing value of the previous period's portfolio equals the opening value V_i of the new portfolio (no external cash is injected or withdrawn). Equivalently, the financing gap D_i = 0 for every i.",
      "Financing gap D_i": "The difference between the opening value V_i and the cost of acquiring the holdings φ_i S_i + ψ_i B_i at time i: D_i = V_i − φ_i S_i − ψ_i B_i. Self-financing iff D_i = 0.",
      "Delta (increment) notation": "ΔV_i denotes the change in strategy value from time i−1 to i: ΔV_i = V_i − V_{i−1}. Similarly ΔS_i = S_i − S_{i−1}, ΔB_i = B_i − B_{i−1}.",
      "Arbitrage price (martingale measure Q)": "The no-arbitrage price of a claim X is the expectation under the martingale measure Q of the discounted payoff, i.e., E_Q[B_T^{-1} X]. This price is replicated by the self-financing strategy and thus is arbitrage-free."
    },
    "theorems": [
      {
        "name": "Self-financing characterization",
        "statement": "A trading strategy (φ_i, ψ_i) is self-financing iff the financing gap D_i = V_i − φ_i S_i − ψ_i B_i is zero for all times i. Equivalently, when D_i = 0, the increment in portfolio value satisfies ΔV_i = φ_i ΔS_i + ψ_i ΔB_i.",
        "implication": "This condition ensures that portfolio value changes arise only from market movements in S and B, so portfolios can be rolled forward without external cash flows."
      },
      {
        "name": "Arbitrage pricing via martingale measure",
        "statement": "If Q is a measure under which the discounted stock process is a martingale and a claim X is replicable by a self-financing strategy, then the no-arbitrage price of X at time 0 is the expectation of its discounted payoff under Q: price = E_Q[B_T^{-1} X].",
        "implication": "Any other price would allow an arbitrage: the replicating self-financing strategy (φ_i, ψ_i) would produce risk-free profit if X were mispriced relative to this expectation."
      }
    ],
    "equations": [
      {
        "latex": "V_i = \\varphi_{i+1} S_i + \\psi_{i+1} B_i",
        "meaning": "Opening value (worth) of the trading strategy at time i equals the market value of the holdings (φ_{i+1} units of stock and ψ_{i+1} units of bond) evaluated at current prices.",
        "intuition": "At the start of period i the portfolio is composed of holdings decided at the previous decision time; V_i is just those holdings marked to market."
      },
      {
        "latex": "D_i = V_i - \\varphi_i S_i - \\psi_i B_i = 0",
        "meaning": "The financing gap D_i compares the opening value V_i to the cost of the holdings chosen at time i; self-financing requires D_i = 0.",
        "intuition": "No external cash enters or leaves: the cost to set up the new holdings equals the available portfolio value."
      },
      {
        "latex": "\\Delta V_i = \\varphi_i \\Delta S_i + \\psi_i \\Delta B_i + D_i",
        "meaning": "General relation for the change in portfolio value over one time step: it equals gains from changes in asset prices plus any financing gap.",
        "intuition": "If D_i = 0 (self-financing), then portfolio value changes are exactly the gains/losses from the assets held."
      },
      {
        "latex": "B_T E_T = B_T \\mathbb{E}_Q[B_T^{-1} X\\mid\\mathcal{F}_T] = X",
        "meaning": "At maturity the discounted-then-undiscounted conditional expectation equals the payoff: multiplying the conditional expectation of the discounted payoff by B_T returns the actual payoff X.",
        "intuition": "The martingale (discounted expectation) evaluated at terminal time recreates the payoff exactly; this is the final step of the replication argument (the replicating portfolio equals the claim at T)."
      },
      {
        "latex": "\\text{No-arbitrage price } = \\mathbb{E}_Q\\big[B_T^{-1} X\\big]",
        "meaning": "The fair (arbitrage) price of claim X is the expectation under the martingale measure Q of the claim discounted to time 0.",
        "intuition": "Because a self-financing replicating strategy exists under Q, its initial cost equals this expectation; any different price allows arbitrage by buying/selling the replicating portfolio."
      }
    ],
    "figures": [],
    "tables": []
  },
  {
    "chunk_summary": "Pages 34–36 formalize self-financing hedging strategies in the discrete (binomial) market and state the pricing result under the martingale measure. A trading strategy (φ_i, ψ_i) is a self-financing replicating strategy for a claim X if both holdings are previsible, the change in portfolio value equals holdings times asset increments, and the terminal portfolio equals X. From this follows the discrete-time option pricing formula: the no-arbitrage price at time i equals B_i · E_Q[B_T^{-1} X | F_i], where Q is a probability measure under which the discounted stock is a martingale. In the discrete model a (sensible) stock process admits a unique such martingale measure Q.",
    "key_definitions": {
      "self-financing strategy": "A pair of processes (φ_i, ψ_i) (stock and bond holdings) is a self-financing strategy to construct claim X if (1) both φ and ψ are previsible (known at the previous time step), (2) the portfolio value changes only because of asset price changes (ΔV_i = φ_i ΔS_i + ψ_i ΔB_i), and (3) the terminal portfolio φ_T S_T + ψ_T B_T equals the claim X identically.",
      "ΔS_i": "Increment of the stock process over one tick: ΔS_i := S_i - S_{i-1}.",
      "ΔB_i": "Increment of the bond (cash) process over one tick: ΔB_i := B_i - B_{i-1}.",
      "previsible": "A process whose value at time i is measurable with respect to the information available up to time i−1 (i.e., decided before the price move at i).",
      "discounted claim": "The claim expressed in units of the cash bond at maturity: B_T^{-1} X.",
      "martingale measure Q (brief)": "A probability measure under which the discounted stock (B^{-1} S) is a martingale; used to compute arbitrage-free prices via discounted expectations."
    },
    "theorems": [
      {
        "id": "self-financing-hedging-conditions",
        "statement": "Given a binomial tree market with stock S and bond B, (φ_i, ψ_i) is a self-financing strategy that replicates claim X if (1) φ and ψ are previsible; (2) ΔV_i = φ_i ΔS_i + ψ_i ΔB_i for each i; and (3) φ_T S_T + ψ_T B_T = X.",
        "implication": "If such a self-financing replicating strategy exists, the cost of initiating that strategy equals the arbitrage-free price of X and it produces X at maturity without additional funding."
      },
      {
        "id": "option-price-formula-discrete",
        "statement": "Option value (arbitrage price) at tick-time i of a claim X maturing at T is V_i = B_i · E_Q[B_T^{-1} X | F_i], where Q is any measure making the discounted stock a Q-martingale and F_i is the filtration at time i.",
        "implication": "The arbitrage-free price is the discounted conditional expectation of the payoff under the martingale measure; this price is justified because there exists a self-financing replicating strategy (by binomial representation) whose initial cost equals that expectation."
      },
      {
        "id": "existence-uniqueness-of-martingale-measure",
        "statement": "In a discrete (binomial) model, for any sensible stock process S there exists a unique probability measure Q under which the discounted stock B_T^{-1} S_i (equivalently B^{-1} S) is a Q-martingale.",
        "implication": "There is a single martingale measure Q that yields the arbitrage-free pricing rule above; the real-world measure P is irrelevant for pricing in this framework."
      }
    ],
    "equations": [
      {
        "latex": "\\Delta V_i = \\phi_i \\Delta S_i + \\psi_i \\Delta B_i",
        "meaning": "Difference equation for the portfolio value change: the change in the portfolio value between times i−1 and i equals holdings (decided at time i) times the corresponding asset increments.",
        "intuition": "A self-financing portfolio's value changes only due to gains/losses on the assets held; there is no external cash injection or withdrawal (no financing gap)."
      },
      {
        "latex": "\\phi_T S_T + \\psi_T B_T = X",
        "meaning": "Terminal replication condition: the holdings at maturity produce exactly the claim payoff X for every state of the world.",
        "intuition": "The self-financing strategy must end up replicating the claim; this guarantees the strategy hedges the claim perfectly so initial cost equals arbitrage price."
      },
      {
        "latex": "V_i = B_i\\,\\mathbb{E}_Q\\big[B_T^{-1} X \\mid \\mathcal{F}_i\\big]",
        "meaning": "Option (derivative) price at time i equals the cash-bond value at i times the conditional expectation under Q of the discounted payoff at maturity.",
        "intuition": "Price today is the present value of expected payoff under the risk-neutral/martingale measure Q; the discounting by B_T and multiplication by B_i adjust units to time i and ensure no-arbitrage valuation."
      },
      {
        "latex": "\\Delta S_i := S_i - S_{i-1}, \\qquad \\Delta B_i := B_i - B_{i-1}",
        "meaning": "Definitions of single-step increments for the stock and bond processes.",
        "intuition": "These increments are the elementary building blocks of discrete-time gains and are used to compute portfolio value changes in the self-financing condition."
      }
    ],
    "figures": [],
    "tables": []
  },
  {
    "chunk_summary": "This concluding slide restates the main discrete-time result: in a binomial (discrete) model there is a general theorem that any claim on a stock can be replicated by a self-financing construction strategy. If the market prices differ from the replication cost, arbitrage opportunities arise. The arbitrage-justified price of a derivative is the expectation of the discounted payoff computed under the single special measure Q that makes the discounted stock a martingale; the real-world measure P is irrelevant. The self-financing replication strategy produces the claim for all possible stock paths.",
    "key_definitions": [
      {
        "term": "Claim",
        "definition": "A payoff (random variable) defined on the nodes at a specified maturity T; the derivative's terminal cashflow to be replicated/priced."
      },
      {
        "term": "Derivative instrument (replicable claim)",
        "definition": "A financial contract whose payoff depends on the underlying stock; in the discrete model it can be exactly replicated by a trading strategy in the stock and bond."
      },
      {
        "term": "Discounted claim",
        "definition": "The claim payoff at maturity divided by the bond (money-market) value at maturity; used to express values under the martingale measure for pricing."
      },
      {
        "term": "Martingale measure (Q)",
        "definition": "The (unique) probability measure under which the discounted stock price process is a martingale; expectation under Q gives arbitrage-free prices."
      },
      {
        "term": "Real-world measure (P)",
        "definition": "The actual probability measure describing the physical evolution of the stock. According to the conclusion, P is irrelevant to arbitrage-free pricing."
      },
      {
        "term": "Self-financing strategy",
        "definition": "A trading strategy in the stock and bond that requires no external cash injections after initiation: changes in portfolio value come only from asset gains/losses, and the strategy replicates the claim at maturity."
      },
      {
        "term": "Arbitrage-justified value",
        "definition": "The unique price consistent with no-arbitrage that equals the cost to set up the self-financing replication; computable as an expectation of the discounted claim under Q."
      }
    ],
    "theorems": [
      {
        "name": "Discrete-time arbitrage pricing (conclusion statement)",
        "statement": "In the discrete binomial model there exists a construction (replication) strategy that is self-financing and produces any claim on the stock. The arbitrage-free price of the claim is the expectation of its discounted payoff under the unique measure Q under which the discounted stock is a martingale. Any deviation from that price yields arbitrage.",
        "conditions": "Discrete-time binomial market model with a stock and a positive bond process; existence of a measure Q making the discounted stock a martingale (this measure is unique in the discrete setting).",
        "intuition": "If you can replicate the claim perfectly with a portfolio of stock and bond and that portfolio is self-financing, then the initial cost of that portfolio must equal the fair price; otherwise an arbitrageur could buy the underpriced claim and short the replicating portfolio (or vice versa) to earn risk-free profits. The martingale measure Q is the probabilistic tool that encodes these replication prices via discounted expectations.",
        "consequences": [
          "Pricing reduces to computing conditional expectations under Q of the discounted payoff.",
          "The physical probability distribution (P) of stock moves is irrelevant to pricing and hedging in this (complete) discrete model.",
          "Uniqueness of replication implies uniqueness of the arbitrage-free price."
        ]
      }
    ],
    "equations": [],
    "figures": [],
    "tables": []
  }
]