[
  {
    "chunk_summary": [
      {
        "page": 1,
        "summary": "Introduces the goal: use discrete-time models with very small intertick time to approximate continuous-time price dynamics. States that a simple discrete model with constant drift and noise approximates a log-normal distribution under both the real measure P and the martingale measure Q, and that this approach can be used (non-rigorously) to derive the Black–Scholes formula."
      },
      {
        "page": 2,
        "summary": "Presents the discrete model setup. Parameters: intertick time δt (to be taken to 0), volatility σ, stock growth rate μ, and riskless rate r. Cash bond B_t = exp(r t). Stock follows a recombinant multiplicative binomial tree: from current value s the next-step values are s·exp(μ δt ± σ√δt). Jumps are equally likely with p = 1/2."
      },
      {
        "page": 3,
        "summary": "Derives the multi-step expression for S_t after n = t/δt ticks: S_t = S_0 exp( μ t + σ √t (2 X_n − n)/√n ). Notes X_n ~ Binomial(n,1/2) with mean n/2 and variance n/4 so (2X_n − n)/√n has mean 0 and variance 1. By the Central Limit Theorem this term converges to N(0,1) as n→∞, hence log S_t converges to a normal distribution with mean log S_0 + μ t and variance σ^2 t, i.e., S_t becomes log-normal in the continuous limit."
      }
    ],
    "key_definitions": [
      {
        "term": "intertick time",
        "symbol": "δt",
        "definition": "Length of one discrete time step. The continuous limit is obtained by letting δt → 0.",
        "page": 2
      },
      {
        "term": "volatility (noisiness)",
        "symbol": "σ",
        "definition": "Scale of the random multiplicative shocks in each step; appears as ±σ√δt in one-step log-returns.",
        "page": 2
      },
      {
        "term": "stock growth rate (drift)",
        "symbol": "μ",
        "definition": "Deterministic component of one-step log-return, appears as μ δt per step.",
        "page": 2
      },
      {
        "term": "riskless interest rate",
        "symbol": "r",
        "definition": "Constant rate for the cash bond; B_t = exp(r t). (Introduced on page 2.)",
        "page": 2
      },
      {
        "term": "cash bond",
        "symbol": "B_t",
        "definition": "Riskless asset evolving deterministically: B_t = exp(r t).",
        "page": 2
      },
      {
        "term": "number of ticks",
        "symbol": "n",
        "definition": "Number of discrete steps up to time t: n = t / δt.",
        "page": 3
      },
      {
        "term": "up-jump count",
        "symbol": "X_n",
        "definition": "Total number of up-jumps among n independent steps; X_n ~ Binomial(n, 1/2) under the model in pages 1–3.",
        "page": 3
      }
    ],
    "theorems": [],
    "equations": [
      {
        "latex": "S_{\\text{up}} = s\\,\\exp\\left(\\mu\\,\\delta t + \\sigma\\sqrt{\\delta t}\\right),\\quad S_{\\text{down}} = s\\,\\exp\\left(\\mu\\,\\delta t - \\sigma\\sqrt{\\delta t}\\right)",
        "meaning": "One-step multiplicative update for the stock in the recombining binomial tree: deterministic drift μδt plus a ±σ√δt random component.",
        "intuition": "Modeling log-returns over a short interval δt as the sum of a small deterministic drift term and a random shock whose standard deviation scales like √δt, so the multiplicative factor is close to 1 for small δt."
      },
      {
        "latex": "n = \\frac{t}{\\delta t}",
        "meaning": "Number of discrete time steps (ticks) in the interval [0,t].",
        "intuition": "As δt → 0, n → ∞ for fixed t, allowing application of limit theorems over many small independent steps."
      },
      {
        "latex": "S_t = S_0\\exp\\left(\\mu t + \\sigma\\sqrt{t}\\,\\frac{2X_n - n}{\\sqrt{n}}\\right)",
        "meaning": "Exact expression in the discrete model for the stock value at time t after n steps, expressed in terms of the number X_n of up-jumps.",
        "intuition": "Log-price decomposes into deterministic drift μt plus a scaled aggregate noise term: (2X_n-n)/√n behaves like an average of ±1 shocks, multiplied by σ√t gives the cumulative volatility scaling."
      },
      {
        "latex": "X_n\\sim\\mathrm{Binomial}(n,\\,1/2),\\quad E[X_n]=\\frac{n}{2},\\quad\\mathrm{Var}(X_n)=\\frac{n}{4}",
        "meaning": "Distributional properties of the number of up-jumps under the symmetric jump probability p=1/2.",
        "intuition": "Each step is an independent fair up/down trial; mean and variance scale linearly with n."
      },
      {
        "latex": "\\frac{2X_n - n}{\\sqrt{n}} \\xrightarrow{d} N(0,1)\\quad(\\text{as }n\\to\\infty)",
        "meaning": "By the Central Limit Theorem, the centered and scaled sum of the ±1 step indicators converges in distribution to a standard normal.",
        "intuition": "Many small independent symmetric increments aggregate to Gaussian noise in the continuous limit."
      },
      {
        "latex": "\\log S_t \\xrightarrow{d} N\\big(\\log S_0 + \\mu t,\\;\\sigma^2 t\\big)",
        "meaning": "In the continuous-time limit, the log-price is normally distributed with mean log S_0 + μt and variance σ^2 t, so S_t is log-normal.",
        "intuition": "Deterministic accumulation of drift plus Gaussian aggregate noise yields a normal law for log-prices; multiplicative model yields log-normal prices."
      }
    ],
    "figures": [
      {
        "id": "page1",
        "type": "slide",
        "description": "Title slide 'Overture to continuous models' with bullet points stating motivation: discrete techniques approximate continuous time, discrete model approximates log-normal under P and Q, and can lead to Black–Scholes formula informally.",
        "axes": [],
        "trend": null,
        "significance": "Sets context and goals for the subsequent modeling: motivate approximation of continuous-time models using a discrete binomial-like framework."
      },
      {
        "id": "page2",
        "type": "slide",
        "description": "Slide 'Model with constant stock growth and noise' listing parameters (δt, σ, μ, r), cash bond formula B_t = exp(r t), one-step update formulas for up/down moves, and statement that p = 1/2.",
        "axes": [],
        "trend": null,
        "significance": "Specifies the discrete-time multiplicative model structure and parameters that will be analyzed in the small-δt limit."
      },
      {
        "id": "page3",
        "type": "slide",
        "description": "Slide 'Model with constant stock growth and noise, continued' deriving S_t after n = t/δt steps, definition of X_n, binomial mean/variance, and application of CLT to argue log-normal limit.",
        "axes": [],
        "trend": null,
        "significance": "Shows the derivation connecting the discrete model to the continuous log-normal limit via binomial aggregation and the Central Limit Theorem; central technical slide for the approximation argument."
      }
    ],
    "tables": []
  },
  {
    "chunk_summary": "Pages 4–6 analyze the discrete-to-continuous approximation under the martingale measure Q and apply it to price a European call. Starting from the discrete recombining tree, the martingale measure probability q for an up-jump is derived (exact formula and small-δt approximation). Under Q the binomial count X_n has mean n q and variance n q(1−q); after normalization (2X_n−n)/√n its distribution converges by the Central Limit Theorem to a normal with mean −√t(μ + 1/2 σ^2 − r)/σ and variance → 1. Consequently S_t is log-normal under Q with log-mean log S0 + (r − 1/2 σ^2) t and variance σ^2 t; equivalently S_t = S0 exp(σ √t Z + (r − 1/2 σ^2) t) with Z ~ N(0,1) under Q. The call price is expressed as the discounted Q-expectation of (S_T − k)+ and evaluated in closed form as the Black–Scholes formula using standard normal CDF Φ.",
    "key_definitions": {
      "Q (martingale measure)": "The risk-neutral probability measure under which discounted asset prices are martingales; expectations under Q are used for pricing.",
      "q (martingale up-jump probability)": "The risk-neutral probability assigned to an up-step in the discrete tree, computed so that discounted stock is a martingale.",
      "X_n": "Number of up-jumps in n discrete ticks (binomial random variable).",
      "S_t under Q (marginal)": "Stock price at time t under the martingale measure; shown to be log-normal with parameters determined by r and σ.",
      "B_t (cash bond)": "Riskless bank account process; B_t = exp(r t).",
      "Call option X": "European call with maturity T and strike k; payoff X = (S_T − k)+.",
      "Φ": "Standard normal cumulative distribution function, Φ(x) = Q(Z ≤ x) for Z ~ N(0,1)."
    },
    "theorems": [
      {
        "name": "Central Limit Theorem (invoked)",
        "statement": "For the binomial count X_n with mean n/2 (or mean n q under Q) and variance proportional to n, the normalized sum (2X_n − n)/√n converges in distribution to a normal random variable as n → ∞ (equivalently δt → 0, n = t/δt → ∞).",
        "role_in_chunk": "Used to justify that the discrete log-returns converge to a normal distribution and hence S_t becomes log-normal in the continuous-time limit, both under P and under the martingale measure Q."
      }
    ],
    "equations": [
      {
        "latex": "q = \\frac{s\\,e^{r\\delta t} - s_{\\text{down}}}{s_{\\text{up}} - s_{\\text{down}}}",
        "meaning": "Exact expression for the risk-neutral up-step probability q in a one-step discrete tree ensuring the discounted stock is a martingale.",
        "intuition": "Choose q so the expected next-step stock price, discounted at the risk-free rate, equals the current price (martingale condition)."
      },
      {
        "latex": "q \\approx \\tfrac{1}{2} \\left(1 - \\sqrt{\\delta t}\\,\\frac{\\mu + \\tfrac{1}{2}\\sigma^2 - r}{\\sigma}\\right)",
        "meaning": "Small-δt approximation of the martingale probability q in terms of model parameters μ, σ, r.",
        "intuition": "When time-steps are small, q is near 1/2 with a correction proportional to √{δt} driven by the difference between real drift μ (plus volatility correction) and the risk-free rate r."
      },
      {
        "latex": "\\text{Mean}\\left(\\frac{2X_n - n}{\\sqrt{n}}\\right) = -\\sqrt{t}\\,\\frac{\\mu + \\tfrac{1}{2}\\sigma^2 - r}{\\sigma}, \\quad \\text{Var}\\to 1",
        "meaning": "Limit mean and variance of the normalized up-count under Q (with n = t/δt).",
        "intuition": "The normalization converts the binomial fluctuation to a Gaussian with a deterministic shift depending on the drift mismatch; variance tends to 1 by binomial scaling."
      },
      {
        "latex": "S_t = S_0\\,\\exp\\!\\left(\\sigma\\sqrt{t}\\,Z + \\left(r - \\tfrac{1}{2}\\sigma^2\\right)t\\right), \\quad Z\\sim N(0,1)\\text{ under }Q",
        "meaning": "Marginal distribution of S_t under the martingale measure Q: log-normal with mean parameter (r − 1/2 σ^2) t and variance σ^2 t.",
        "intuition": "Under risk-neutral valuation, the drift in log-price is r − 1/2 σ^2 so that discounted stock is a martingale; randomness comes from σ√t Z."
      },
      {
        "latex": "V_0 = E_Q\\left[B_T^{-1}\\,(S_T - k)^+\\right] = E_Q\\left[\\left(S_0\\exp\\left(\\sigma\\sqrt{T}Z - \\tfrac{1}{2}\\sigma^2 T\\right) - k e^{-rT}\\right)^+\\right]",
        "meaning": "Price at time 0 of a European call computed as the discounted Q-expectation of its payoff.",
        "intuition": "Under Q, price is present value of expected payoff; substituting S_T's log-normal form converts pricing to an expectation over a normal variable Z."
      },
      {
        "latex": "V_0 = S_0\\,\\Phi\\!\\left(\\frac{\\ln(S_0/k) + (r + \\tfrac{1}{2}\\sigma^2)T}{\\sigma\\sqrt{T}}\\right) - k e^{-rT}\\,\\Phi\\!\\left(\\frac{\\ln(S_0/k) + (r - \\tfrac{1}{2}\\sigma^2)T}{\\sigma\\sqrt{T}}\\right)",
        "meaning": "Black–Scholes closed-form expression for the European call price using the standard normal CDF Φ.",
        "intuition": "The expectation over truncated log-normal payoff can be evaluated by change of variables to normal Z, yielding two Φ-terms representing probabilities/weights for the option being in-the-money adjusted by discounting."
      }
    ],
    "figures": [
      {
        "id": "fig_page4",
        "type": "slide_diagram",
        "description": "Slide titled 'Under the martingale measure' displaying the exact martingale-probability formula for q and its small-δt approximation, plus the statement that X_n is binomial with mean n q and variance n q(1−q).",
        "axes": "none",
        "trend": "none (textual/formula content)",
        "significance": "Introduces the risk-neutral probability q and shows how the discrete model's jump probabilities are adjusted under Q; sets up the distributional calculations required to pass to the continuous limit."
      },
      {
        "id": "fig_page5",
        "type": "slide_diagram",
        "description": "Continuation slide 'Under the martingale measure, continued' which states the mean and asymptotic variance of (2X_n−n)/√n, invokes the Central Limit Theorem, and gives the log-normal expression for S_t under Q: S_t = S_0 exp(σ√t Z + (r − 1/2 σ^2) t).",
        "axes": "none",
        "trend": "none (textual/formula content)",
        "significance": "Concludes the limiting distribution under Q, showing that the discrete model converges to the geometric Brownian motion marginal used in Black–Scholes pricing."
      },
      {
        "id": "fig_page6",
        "type": "slide_diagram",
        "description": "Slide 'Pricing a call option' that defines the call payoff X = (S_T − k)+, writes the pricing expectation under Q, and states the resulting Black–Scholes formula with normal CDF Φ.",
        "axes": "none",
        "trend": "none (textual/formula content)",
        "significance": "Connects the derived log-normal law under Q to option valuation and presents the closed-form Black–Scholes price expression."
      }
    ],
    "tables": []
  }
]